# ---- Завдання перше 1 ----

# Rng_Num1_1 = int(input('Input first number: '))
# Rng_Num2_1 = int(input('Input second number: '))
# for i_1 in range(Rng_Num1_1, Rng_Num2_1):
#     if ..Я зупинився на умові 
    # думав думав, щось пробував але не вийшло, вирішив подивитися в інтернеті
    # зрозумів що нічого я там не зрозумів
    # та й пропустив завдання (якщо можна надішліть правильне виконання, може щось зрозумію)

# ---- Завдання друге 2 ----

for i_2 in range(1, 11): # 11 щоб включало 10 також
    # формула
    Dsc = f"{i_2} * 1 = {i_2 *1}, {i_2} * 2 = {i_2 *2}, {i_2} * 3 = {i_2 *3}, {i_2} * 4 = {i_2 *4}, {i_2} * 5 = {i_2 *5}, {i_2} * 6 = {i_2 *6}, {i_2} * 7 = {i_2 *7}, {i_2} * 8 = {i_2 *8}, {i_2} * 9 = {i_2 *9}, {i_2} * 10 = {i_2 *10}"
    print(Dsc) # виводимо результат

print('\n')
# ---- Завдання третє 3 ----

Rng_Num1_3 = int(input('Input first number: ')) # просимо користувача вести 2 числа
Rng_Num2_3 = int(input('Input second number: '))
# числа добавляємо у діапазон
for i_3 in range(Rng_Num1_3, Rng_Num2_3+1): # добавляємо 1 щоб включало 2 число також
    # формула
    Dsc = f"{i_3} * 1 = {i_3 *1}, {i_3} * 2 = {i_3 *2}, {i_3} * 3 = {i_3 *3}, {i_3} * 4 = {i_3 *4}, {i_3} * 5 = {i_3 *5}, {i_3} * 6 = {i_3 *6}, {i_3} * 7 = {i_3 *7}, {i_3} * 8 = {i_3 *8}, {i_3} * 9 = {i_3 *9}, {i_3} * 10 = {i_3 *10}"
    print(Dsc) # виводимо результат