# я буду використовувати 1 список словників у 1-му та 2-му завданні
DictList_1 = [
    {
      'name': 'Блендер',
      'price': 2000
    },
    {
      'name': 'Мікрохвилбова піч',
      'price': 3500
    },
    {
      'name': 'Тостер',
      'price': 1750
    },
    {
      'name': 'Телевізор',
      'price': 11500
    },
    {
      'name': 'Принтер',
      'price': 4700
    }
]
# --- Завдання перше 1 ----

# for item in DictList_1:

# В мене з цим завданням виникли труднощі, вибачте, я не зміг це
# зробити, якщо можете то скиньте правильне виконання.


# --- Завдання друге 2 ----

ExpenciveList = [] # створюємо пустий список в який ми будем записувати дорогі товари
for item in DictList_1: # створюємо цикл
    if item['price'] >= 3000: # задаєм умови в якій якщо ціна товару більше 3000 то...
        ExpenciveList.append(item) # ... ми записуємо товар у список дорогих товарів
print(ExpenciveList) # виводимо результат на екран

print('\n\n')
# --- Завдання третє 3 ----

DictList_2 = [
    {'Яблука':45}, {'Апельсини':20}, {'Банани':8}, {'Кавуни':9}, {'Лимони':15}, {'Мандарини': 12}
]
# for item in DictList_2:  __ Я не знаю як це зробити, як варіант можна попросити користувача ввести назву...
#     while item[] < 15:   __ ... товару і з нею робити умови, але умова задачі інша.
#         print(f"{item} - нестача товару") __ Як і з першим, можете скинути правильне розв'язання.